app/src/main/assets/help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-21 Mon 22:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="David Mann" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./org.css"/>
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org267204e" class="outline-2">
<h2 id="org267204e">MorbidMeter Help</h2>
<div class="outline-text-2" id="text-org267204e">
<button class="back-button" onclick="Android.close()">Close</button>
    <style>
        /* Basic styling for the back button */
        .back-button {
            background-color: #4CAF50; /* Green */
            border: none;
            color: white;
            padding: 15px 32px;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            font-size: 16px;
            margin: 4px 2px;
            cursor: pointer;
        }
    </style>
</div>
<div id="outline-container-org0deba94" class="outline-3">
<h3 id="org0deba94">MorbidMeter is a long-term timer</h3>
<div class="outline-text-3" id="text-org0deba94">
<ul class="org-ul">
<li>The original <i>raison d'être</i> for MorbidMeter was to put your own lifetime into perspective.  You enter your birthdate and projected deathdate, and MorbidMeter shows you where you are in between those two dates.  Originally the idea was to map your lifetime onto a single year, so that your birthday would be on January 1st at midnight, and your deathday would be on December 31st at midnight.  For example, if you planned to live to age 80, and you were now 40 years old, your MorbidMeter date would be around July 1st.</li>
<li>However, MorbidMeter is not limited to mapping your life onto a single year.  You can map it onto a month, a week, a day, or even an hour.</li>
<li>You can also see how many months, weeks, days, minutes, or even seconds you have already lived, or have to live.  These are just some of the time scales available in the MorbidMeter widget.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf81604d" class="outline-3">
<h3 id="orgf81604d">Other uses</h3>
<div class="outline-text-3" id="text-orgf81604d">
<ul class="org-ul">
<li>You don't have to be so morbid.  You can use MorbidMeter as a general purpose long-term timer for any long-term task, like counting down the time until retirement, or assessing how much time you have left to finish your doctoral thesis.</li>
<li>What MorbidMeter is NOT is a short-term timer.  Don't use it to time how long to steep your teabag or use it for your 3 minute eggs.</li>
</ul>
</div>
</div>
<div id="outline-container-orge56b11b" class="outline-3">
<h3 id="orge56b11b">How to use</h3>
<div class="outline-text-3" id="text-orge56b11b">
<ul class="org-ul">
<li>When you first drag the widget onto the screen, a configure screen appears.  You can bring back this screen later by clicking on the Skull, which is a button.</li>
<li>Use the configuration screen to fill in your name, birthday, estimated deathday (or start day and end day if you are not so morbid).</li>
<li>Choose a time scale from the drop down list.</li>
<li>Choose an update frequency.  Note that by default, MorbidMeter uses an inexact timer, which saves battery life.  If you are using MorbidMeter to time your life, you certainly don't need an exact timer that updates every minute.  Choose the longest update frequency that you can.</li>
<li>You CAN use exact timing if you wish, though you will be asked to give exact timing permission by the Android OS if you do so.</li>
<li>Note that the real time clock time scales update every second, but don't waste battery because these clocks are provided by the operating system.  However, the progress bar on the widget still uses the update frequency you select.</li>
</ul>
</div>
</div>
<div id="outline-container-org6112db1" class="outline-3">
<h3 id="org6112db1">Multiple widgets</h3>
<div class="outline-text-3" id="text-org6112db1">
<ul class="org-ul">
<li>You can have multiple different MorbidMeter widgets on your screen with different parameters at the same time. Long press and drag to the trash any MorbidMeter widget that you are done with.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
